nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/driver_examples/i2c/dma_b2b_transfer/master/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_14_MASK 0x4000u /*!<@brief Pull Resistor Enable Bits Mask for item 14. */
#define GPIO_PUR_PU_15_MASK 0x8000u /*!<@brief Pull Resistor Enable Bits Mask for item 15. */
#define PUR_PU_14_ENABLED 0x4000u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_15_ENABLED 0x8000u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
